---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ErrorInFamilyResolved
source: html/2fe3b885-64ad-58e9-d585-2c544c3ec92b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ErrorInFamilyResolved Property

An error occurred in family "[Name]" and was automatically resolved. Please review changes made to the family.\nError Information:\n"[Text]"\nError Resolution: [Resolution]

## Syntax (C#)
```csharp
public static FailureDefinitionId ErrorInFamilyResolved { get; }
```